Repository: stanislavkononiuk/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/calldata.po
Languages: ru

source: Callback data factory
ru: Фабрика callback data

source: Callback data factory in pyTelegramBotAPI
ru: Фабрика callback data в pyTelegramBotAPI

source: ptba, pytba, pyTelegramBotAPI, callbackdatafactory, guide, callbackdata, factory
ru: ptba, pytba, pyTelegramBotAPI, callbackdatafactory, гайд, callbackdata, фабрика

source: callback\_data file
ru: Файл callback\_data

source: Callback data factory's file.
ru: Файл фабрики callback data.

source: Bases: :py:class:`object`
ru: Базовые классы: :py:class:`object`

source: Callback data factory This class will help you to work with CallbackQuery
ru: Фабрика Callback data. Этот класс поможет вам в работе с CallbackQuery

source: Generate filter
ru: Сгенерировать фильтр

source: specified named parameters will be checked with CallbackQuery.data
ru: заданные именованные параметры будут проверены в CallbackQuery.data

source: CallbackDataFilter class
ru: Класс CallbackDataFilter

source: Generate callback data
ru: Сгенерировать callback data

source: positional parameters of CallbackData instance parts
ru: позиционные параметры экземпляра CallbackData

source: named parameters
ru: именованные параметры

source: Parse data from the callback data
ru: Получить данные из callback data

source: string, use to telebot.types.CallbackQuery to parse it from string to a dict
ru: string, примените к telebot.types.CallbackQuery, чтобы преобразовать callback_data из строки (str) в словарь (dict)

source: dict parsed from callback data
ru: словарь (dict), полученный из callback data

source: Filter for CallbackData.
ru: Фильтр для CallbackData.

source: Checks if query.data appropriates to specified config
ru: Проверяет, соответствует ли query.data заданной конфигурации

source: True if query.data appropriates to specified config
ru: True, если query.data соответствует заданной конфигурации
