Repository: stanislavkononiuk/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/formatting.po
Languages: ru

source: Formatting options
ru: Параметры форматирования

source: Formatting options in pyTelegramBotAPI
ru: Параметры форматирования в pyTelegramBotAPI

source: html, markdown, parse_mode, formatting, ptba, pytba, pyTelegramBotAPI
ru: html, markdown, parse_mode, форматирование, ptba, pytba, pyTelegramBotAPI

source: Markdown & HTML formatting functions.
ru: Функции форматирования Markdown & HTML.

source: Escapes HTML characters in a string of HTML.
ru: Пропускает HTML символы в HTML строке.

source: The string of HTML to escape.
ru: HTML строка, которую нужно пропустить.

source: The escaped string.
ru: Пропускаемая строка.

source: Escapes Markdown characters in a string of Markdown.
ru: Пропускает Markdown символы в Markdown строке.

source: The string of Markdown to escape.
ru: Markdown строка, которую нужно пропустить.

source: Formats a list of strings into a single string.
ru: Преобразовывает набор строк в одну.

source: Strings to format.
ru: Строки для преобразования.

source: The separator to use between each string.
ru: Символ для разделения строк.

source: The formatted string.
ru: Преобразованная строка.

source: Returns an HTML-formatted bold string.
ru: Возвращает выделенную жирным шрифтом HTML строку.

source: The string to bold.
ru: Строка для выделения жирным шрифтом.

source: True if you need to escape special characters. Defaults to True.
ru: True если вам нужно пропустить спец. символы. По умолчанию True.

source: Returns an HTML-formatted code string.
ru: Возвращает выделенную как код HTML строку.

source: The string to code.
ru: Строка для выделения как код.

source: Hide url of an image.
ru: Делает невидимым URL изображения.

source: The url of the image.
ru: URL изображения.

source: The hidden url.
ru: Невидимый URL.

source: Returns an HTML-formatted italic string.
ru: Возвращает выделенную курсивом HTML строку.

source: The string to italicize.
ru: Строка для выделения курсивом.

source: Returns an HTML-formatted link string.
ru: Возвращает HTML строку с гиперссылкой.

source: The string to link.
ru: Строка для добавления гиперссылки.

source: The URL to link to.
ru: URL для создания гиперссылки.

source: Returns an HTML-formatted preformatted string.
ru: Возвращает предварительно отформатированную HTML строку.

source: The string to preformatted.
ru: Строка для предварительного форматирования.

source: Returns an HTML-formatted spoiler string.
ru: Возвращает выделенную как спойлер HTML строку.

source: The string to spoiler.
ru: Строка для выделения как спойлер.

source: Returns an HTML-formatted strikethrough string.
ru: Возвращает зачеркнутую HTML строку.

source: The string to strikethrough.
ru: Строка для зачеркивания.

source: Returns an HTML-formatted underline string.
ru: Возвращает подчеркнутую HTML строку.

source: The string to underline.
ru: Строка для подчёркивания.

source: Returns a Markdown-formatted bold string.
ru: Возвращает выделенную жирным шрифтом Markdown строку.

source: Returns a Markdown-formatted code string.
ru: Возвращает выделенную как код Markdown строку.

source: Returns a Markdown-formatted italic string.
ru: Возвращает выделенную курсивом Markdown строку.

source: Returns a Markdown-formatted link string.
ru: Возвращает Markdown строку с гиперссылкой.

source: Returns a Markdown-formatted spoiler string.
ru: Возвращает выделенную как спойлер Markdown строку.

source: Returns a Markdown-formatted strikethrough string.
ru: Возвращает зачеркнутую Markdown строку.

source: Returns a Markdown-formatted underline string.
ru: Возвращает подчеркнутую Markdown строку.
