Repository: stanislavkononiuk/pyTelegramBotAPI
Catalog: docs/source/locales/*/LC_MESSAGES/index.po
Languages: ru

source: Welcome to pyTelegramBotAPI's documentation!
ru: Добро пожаловать в документацию pyTelegramBotAPI!

source: Official documentation of pyTelegramBotAPI
ru: Официальная документация pyTelegramBotAPI

source: ptba, pytba, pyTelegramBotAPI, documentation, guide
ru: ptba, pytba, pyTelegramBotAPI, документация, гайд

source: TeleBot is synchronous and asynchronous implementation of `Telegram Bot API <https://core.telegram.org/bots/api>`_.
ru: TeleBot это синхронная и асинхронная реализация `Telegram Bot API <https://core.telegram.org/bots/api>`_.

source: Chats
ru: Чаты

source: English chat: `Private chat <https://telegram.me/joinchat/Bn4ixj84FIZVkwhk2jag6A>`__
ru: Англоязычный чат: `Private chat <https://telegram.me/joinchat/Bn4ixj84FIZVkwhk2jag6A>`__

source: Russian chat: `@pytelegrambotapi_talks_ru <https://t.me/pytelegrambotapi_talks_ru>`__
ru: Русскоязычный чат: `@pytelegrambotapi_talks_ru <https://t.me/pytelegrambotapi_talks_ru>`__

source: News: `@pyTelegramBotAPI <https://t.me/pytelegrambotapi>`__
ru: Новости: `@pyTelegramBotAPI <https://t.me/pytelegrambotapi>`__

source: Source: `Github repository <https://github.com/eternnoir/pyTelegramBotAPI>`__
ru: Исходники: `Github repository <https://github.com/eternnoir/pyTelegramBotAPI>`__

source: Some features:
ru: Некоторые особенности:

source: Easy to learn and use.
ru: Простой в изучении и использовании.

source: Easy to understand.
ru: Простой в понимании.

source: Both sync and async.
ru: И синхронный, и асинхронный.

source: Examples on features.
ru: Примеры возможностей.

source: States
ru: Состояния (стейты, FSM)

source: And more...
ru: И другое...

source: Content
ru: Содержимое

source: Indices and tables
ru: Ссылки
